{"posts":[{"title":"2022 週記 (31)","text":"其實從大學開始就有寫手帳的習慣，所以在做每週總結的時候，如果有一些想說的話也會順手以週紀的形式寫下來。但那些是寫給自己看的東西，總歸比較隨性。最近有感於，人還是要好好練習表達，好好把生活紀錄下來，所以想在這裡嘗試每週輕鬆地寫一個總結。內容就大概會以當週接觸到的作品（不限媒材 XD）、畫畫的練習近況和一些靈光一閃的想法為主。 本週節錄 本週歌曲推薦: Afterglow - プライド革命 嘗試進行數位大掃除 看了 The Social Dilemma 嘗試畫同人 誠品買書趣聞 同人初體驗從三月開始重新練習畫畫後，雖然基本上是每天都有在練習，也不斷的取得了一些進步。但每次練習的時候，我可以感覺到，我內心深處，總害怕自己用的不是最好的方法在練習，怕自己進入無效練習。導致每次的練習，都是一次的精神內耗。 剛好這禮拜在 B 站看到了這兩個影片【三】感天动地，又好玩又能进步又能加强基础练习的练习方法，被我找到了——有方法的画系列图1【夜幕】绘画训练方法01——不是在画线，是在圈形（附原速） 就覺得，其實我好像也不需要「等到實力夠了再來畫自己想畫的東西」，可以試著嘗試自己做一些同人或是原創作品看看。 於是在禮拜二的時候，就嘗試畫了這季滿喜歡的 Lycoris Recoil 的同人。 意外的，看起來還像是個人，也難得感受到畫畫的樂趣。（也太晚才感受到了）雖然說不上是多好，但這樣的成果，完全超出我對於自己能力的預期。 或許之後可以在平常畫畫的時間裡也加入畫原創的時間。果然，有目標的練習，才能更讓人有動力。 畫畫理應是一件開心的事，在這之後，才是因為想把畫畫得更好，而堆出的無數練習。 誠品買書趣聞假日的時候，去春水堂吃午餐順便逛了誠品。看到了一本書 &lt;選擇障礙世代&gt;，封底的介紹是這樣的： 你可能有過這樣的經驗：夜裡，你打開 Netflix 開始瀏覽，想找部影片來看。你活過不同得標題，看了幾個預告片，甚至還讀了幾篇評論，但就是無法決心要看哪一部電影。三十分鐘就這這樣過去了，你仍然還在瀏覽，所以你乾脆放棄，你現在已經太累，什麼都不想看了，你決定在此停損，直接睡覺。 這樣的狀態，意外的接近我近期的狀態。不管是在練習畫畫的方法，還是日常生活的安排。我總是覺得有好多選擇，害怕去選擇其中一個，又或者是選了其中一個執行了一天就又開使自我懷疑，這是最好的嗎？於是轉去另一個選項，不斷在這之中來回切換。 我隱約覺得，這樣來回切換的狀態是不行的。改變需要時間，培養技能需要時間，吸收知識也需要時間。這樣來回切換，對深入一個領域完全沒有幫助，但又難以控制著自己覺得「 其他方法可能更好」的質疑。 於是，我就毫不猶豫的買了這本書 XD。要是下週看完了，再來分享一下心得。 除了&lt;選擇障礙世代&gt; 以外，我媽還拿了一本書給我 &lt;記得你是誰&gt;，說是覺得很適合我，也就順便買下了。 在去結帳的時候，還被突然出現的路邊大叔，問說要不要幫我結帳可以有比較多折扣。（誠品會會員日有一本七七折的 Quota）之前就有聽過我阿姨分享過類似的事件，但自己真的遇到時，還是感覺很新奇。 我想這也是人性迷人的地方，世界不全是好人，但在你有困難或是不預期的時候，卻又會意外發現世界上其實也有很多好人，以力所能及的方式去釋出自己小小的善意。","link":"/2022/08/07/22-weekly-31/"},{"title":"那個瞬間不會到來","text":"你羨慕嗎那些在影視作品上光彩動人的瞬間奪冠、成名、得獎 你願意嗎以時間為材，以生命為火點燃自己換一個早已將瞬間溶解在淚和汗中的結果 那個瞬間不會到來 對那個瞬間並不真實存在並不會出現在你的生命裡 對那個瞬間真實存在存在於他人的眼裡的你的生命裡 2022.12.01 後記 聽あのバンド後，直覺產生的一些產物","link":"/2022/11/28/the-moment-would-never-come/"},{"title":"2022 週記 (48)","text":"本週節錄 Google 面試 - HC 結果出爐 Blog 計畫重啟 運動是為了更健康的身體 我的百合乃工作是也 (1 - 56) Google 面試 - HC 結果出爐從今年年初找工作開始，經歷了漫長的準備和等待，與 Google 的對決也算是有了一個結果。 先說個結論，HC Approved，但是原本的 Hiring Manager 打算 proceed 另外一個 candidate，所以目前是處在沒有 match 到 team 的狀態。如果之後有 match 到 team 的話，就可以直接發 offer 了。 不過現在年底將近，也沒有什麼 headcount，所以大概要等明年新的 headcount 出來，才會比較好 match 到 team 吧。只能讓子彈再飛一會，等看看了。 之後有空的話，看能會在工作的 Blog 那邊，再寫一篇談談我跟 Google 對決一年的整個過程，實在有夠久的 XD。 Blog 計畫重啟這已經是不知道第幾次嘗試長期寫一個 Blog 了，光是今年來看，這已經是第二次了。今年年中的時嘗試過一次，只維持了一週，隔週的直接因為沒寫完成就一直留在 draft 的狀態了……。 除了一些求好心切，想把內容寫完整再發出來，以至於很容易就拖延最後放棄以外，還會被一些諸如要在哪個平台建立 Blog、要用哪個 Blog 樣式 的瑣事絆住。 但想想，這些其實也都不是那麼重要。以目前來說，這個 Blog 的定位比較像是我用來整理思路、抒發心情、寫一些同人跟原創文章的地方。所以只要好好把想法整理過，然後寫下來就好了。剩下更多的事情，等到寫 Blog 成了跟生活日常一樣的習慣時，再來考慮吧。 不過說來也有趣，在幾次的嘗試過程中，我對於想經營的 Blog 類型及用途也逐漸轉變，從遠本 建立自身品牌的技術 Blog 轉換到了 在想紀錄的時候紀錄、一個能輕鬆發表自己看法的私人創作性 Blog。（當然為了一些職涯規劃，技術 Blog 大概還是要搞的。但是現在就先這樣吧，給自己留一個全然純粹的自由之地。） 運動是為了更健康的身體這部分的心境轉換，其實跟再次開始寫 Blog 是相似的。 習慣的養成，真的是那麼痛苦的一件事情嗎？我覺得不是的。 在意識到做某件事的好處，並且這個好處是自己真心想要的目的後，感覺倒也不是那麼困難。難就難在，我們沒辦法認清自己想達成的目的以及達成這個目的所需要的時間，以至於常常半途而廢。 這禮拜除了寫 Blog 外，也在嘗試培養運動的習慣。這次，我決定重新去審視為什麼我期望自己能擁有這個習慣。 更好的體態？ 當然，誰不想要呢。但事實上，在這件事情上，我並不願意為此付出達成目的所需的時間(寧願去看書或是畫畫 XD)。 更健康的身體？ 是的，為了做更多想做的事情，活久一點是必須的，那麼健康的身體就是必須的，我願意為此付出時間，以達成這個目的。（當然除了活久一點以外，還有增加自己對生活的掌控感、解決近期總是很容易感到疲倦的問題） 如果找不到一個讓自己願意花費這些時間的理由的話，那就算是再好的習慣、再棒的目標，我們都難以堅持著去達成。就放過自己，去做自己真心想做的事情吧。 我的百合乃工作是也 (1 - 56)聽說明年會動畫化，所以這週花了點時間把 &lt;我的百合乃工作是也&gt; 的漫畫補到最新進度，一開始看的時候，意外地想到了 。 這邊先吹一波 ，在我心中絕對是神作等級的。或許不像 &lt;終將成為你&gt; 那樣有深刻探討意義，或許畫風比較古老。但她不拖泥帶水的講了一個很完整的故事，啟程轉合也做的很漂亮。第一次看的時候，甚至還看哭了 QQ。 拉回正題，不愧是能在百合姬上連載 50 話以上的作品…(2017 那時候還是可以在布卡漫畫看百合姬的時候啊)。 除了畫風以外，咖啡廳的設定也滿有趣的。劇情方面，我只能說主 CP 劇情的內容有點深度(一些迴避型人格相關劇情)。如果說主 CP 不斷和解的過程是現實生活中合理的扭曲，那副 CP 絕對是達到我不能理解的扭曲了（別再虐學姊了！），每一話都在刷新我對於扭曲的理解 XD Anyway，就讓我們繼續看下去，劇情還能有多扭吧。頭都洗下去了，有更新就看一下。","link":"/2022/11/25/22-weekly-48/"}],"tags":[],"categories":[{"name":"週記","slug":"週記","link":"/categories/%E9%80%B1%E8%A8%98/"},{"name":"隨筆","slug":"隨筆","link":"/categories/%E9%9A%A8%E7%AD%86/"},{"name":"詩","slug":"隨筆/詩","link":"/categories/%E9%9A%A8%E7%AD%86/%E8%A9%A9/"}],"pages":[{"title":"About","text":"軟體工程師一枚喜歡書寫也喜歡畫畫期許在用理性思考處理問題時，也能用感性接住真實的自己 百合黨吃的很雜，從遊戲、小說、影視到動漫，只要有百合就看絕對的互攻黨，不喜攻受過於鮮明的產出 最近在嗑：搖滾孤獨，主要嗑波虹，但全員排列組合都可以嗑","link":"/about/index.html"}]}